# <p style="background-color:green;font-family:newtimeroman;font-size:200%;color:white;text-align:center;border-radius:20px 20px;"><b>Pandas Interview Questions</b></p>
![](https://www.techproeducation.com/logo/headerlogo.svg)

<b>Yeniliklerden ilk siz haberdar olmak istiyorsanız lütfen bizi takip etmeyi unutmayın </b>[YouTube](https://www.youtube.com/c/techproeducation) | [Instagram](https://www.instagram.com/techproeducation) | [Facebook](https://www.facebook.com/techproeducation) | [Telegram](https://t.me/joinchat/HH2qRvA-ulh4OWbb) | [Whatsapp](https://api.whatsapp.com/send/?phone=%2B15853042959&text&type=phone_number&app_absent=0) | [LinkedIn](https://www.linkedin.com/company/techproeducation/mycompany/) |

https://www.stratascratch.com/

### 1. Pandas nedir ve ne amaçla kullanılır?

Pandas, Python programlama dilinde veri manipülasyonu ve analizi için kullanılan açık kaynak kodlu, hızlı, güçlü, esnek ve kullanımı kolay bir kütüphanedir. Temel olarak iki veri yapısı üzerine kuruludur:

Seriler (Series): Tek boyutlu, etiketlenmiş bir veri dizisidir.

Veri Çerçeveleri (DataFrames): İki boyutlu, etiketlenmiş bir veri tablosu olarak düşünülebilir.

Pandas kütüphanesi, veri bilimi ve makine öğrenmesi alanlarında yaygın olarak kullanılır ve aşağıdaki amaçlarla tercih edilir:

Veri Okuma ve Yazma: CSV, Excel, SQL veritabanları, JSON dosyaları gibi farklı formatlardaki verileri okuma ve bu formatlarda dosyalar yazma imkanı sağlar.

Veri Temizleme: Eksik verileri doldurma, verileri dönüştürme, hatalı verileri düzeltme gibi veri temizleme işlemlerini kolaylaştırır.

Veri Dönüştürme: Verileri yeniden şekillendirme, sütunları birleştirme veya ayırma, verileri gruplama gibi işlemleri gerçekleştirebilirsiniz.

Veri Analizi: Verileri filtreleme, sıralama, istatistiksel hesaplamalar yapma, grafikler oluşturma gibi veri analizi işlemlerini destekler.

Veri Görselleştirme: Matplotlib ve Seaborn gibi popüler görselleştirme kütüphaneleriyle entegre çalışarak verileri görsel olarak analiz etmeyi sağlar.

### 2. Verilen dataframede 25 - 30 yaş aralığındaki kişilere ait verileri yazdırın.

In [1]:
import pandas as pd

In [3]:
data = {
    "Name": ["John", "Emma", "Luke", "Emily", "Oliver"],
    "Age": [25, 28, 32, 21, 35],
    "Gender": ["Male","Female","Male","Female","Male"],
    "Salary": [50000, 60000, 70000, 55000, 80000]
}
df = pd.DataFrame(data)
df

     Name  Age  Gender  Salary
0    John   25    Male   50000
1    Emma   28  Female   60000
2    Luke   32    Male   70000
3   Emily   21  Female   55000
4  Oliver   35    Male   80000

In [4]:
df.loc[(df["Age"]>=25) & (df["Age"]<=30)]

   Name  Age  Gender  Salary
0  John   25    Male   50000
1  Emma   28  Female   60000

In [5]:
# Fatmagül Hocamın yöntemi
df[(df["Age"]>=25) & (df["Age"]<=30)]

   Name  Age  Gender  Salary
0  John   25    Male   50000
1  Emma   28  Female   60000

### 3. Her cinsiyet için maximum ve median maaşları yazdırınız.

In [7]:
df

     Name  Age  Gender  Salary
0    John   25    Male   50000
1    Emma   28  Female   60000
2    Luke   32    Male   70000
3   Emily   21  Female   55000
4  Oliver   35    Male   80000

In [6]:
df.groupby("Gender").aggregate(max_salary=("Salary", "max"),median_salary = ("Salary","median"))

        max_salary  median_salary
Gender
Female       60000        57500.0
Male         80000        70000.0

### 4. Her birey için yaş ve maaşı kullanarak bonus hesaplayan bir fonksiyon uygulayın. Bonus 30 yaşın altındakiler için % 10, 30 yaş ve üzerindekiler için % 15 olmalı.

In [8]:
df

     Name  Age  Gender  Salary
0    John   25    Male   50000
1    Emma   28  Female   60000
2    Luke   32    Male   70000
3   Emily   21  Female   55000
4  Oliver   35    Male   80000

In [9]:
df["bonus"] = df[["Salary","Age"]].apply(lambda x: 0.1*x["Salary"] if x["Age"]<30 else 0.15*x["Salary"], axis=1)
df

     Name  Age  Gender  Salary    bonus
0    John   25    Male   50000   5000.0
1    Emma   28  Female   60000   6000.0
2    Luke   32    Male   70000  10500.0
3   Emily   21  Female   55000   5500.0
4  Oliver   35    Male   80000  12000.0

### 5. Bir dataframede boş değerlerle (missing value) nasıl başa çıkarsınız?

In [10]:
df = pd.DataFrame({'A': [1, 2, None, 4],
                 'B': [5, None, 7, 8],
                 'C': [9, 10, 11, 12]})

df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True  False  False
3  False  False  False

In [11]:
# Tespit etme
df.isna().sum()

A    1
B    1
C    0
dtype: int64

Silme (dropping)

In [ ]:
# Boş değer içeren satırları sil
df.dropna()

# 'B' sütununda boş değer içeren satırları sil
df.dropna(subset=['B'])

# En az 3 adet null olmayan değere sahip satırları tut
df.dropna(thresh=3)

Doldurma (Filling)

In [ ]:
# Boş değerleri 0 ile doldur
df.fillna(0)

# 'A' sütunundaki boş değerleri sütunun ortalaması ile doldur
df['A'].fillna(df['A'].mean(), inplace=True)

# Her sütundaki boş değerleri o sütunun medyanı ile doldur
df.fillna(df.median())

# Önceki değerlerle doldur (ileri yönlü)
df.fillna(method='ffill')

# Sonraki değerlerle doldur (geri yönlü)
df.fillna(method='bfill')

İnterpolasyon (Interpolation)

interpolate() fonksiyonu: Boş değerleri komşu değerlerden tahmin etmek için farklı interpolasyon yöntemleri kullanılır.

In [ ]:
# Lineer interpolasyon kullanarak boş değerleri doldur
df.interpolate(method='linear')

Hangi yöntemin en uygun olduğu, verilerin yapısına, boş değerlerin dağılımına ve analiz amacına bağlıdır.

Veri setiniz büyükse ve boş değerlerin oranı düşükse, silme yöntemi tercih edilebilir.
Boş değerlerin rastgele dağıldığı durumlarda, doldurma yöntemi daha uygun olabilir.
Zaman serisi verilerinde ise interpolasyon yöntemi daha iyi sonuçlar verebilir.

### 6. Pandas'da join ve merge nasıl kullanılır?

pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False)

merge() fonksiyonu daha çok kompleks birleştirmeler için tercih edilir.

Merge Parametreleri:

left: Birleştirilecek sol DataFrame.

right: Birleştirilecek sağ DataFrame.

how: Birleştirme türünü belirtir. 'left', 'right', 'outer', 'inner' değerlerini alabilir. Varsayılan değer 'inner'dır.

-inner: Her iki DataFrame'de de ortak olan satırları döndürür.

-left: Sol DataFrame'deki tüm satırları ve sağ DataFrame'de eşleşen satırları döndürür.

-right: Sağ DataFrame'deki tüm satırları ve sol DataFrame'de eşleşen satırları döndürür.

-outer: Her iki DataFrame'deki tüm satırları döndürür.

on: Birleştirme işleminde kullanılacak sütun adını veya adlarını belirtir.

left_on: Sol DataFrame'de birleştirme işleminde kullanılacak sütun adını veya adlarını belirtir.

right_on: Sağ DataFrame'de birleştirme işleminde kullanılacak sütun adını veya adlarını belirtir.

left_index: Sol DataFrame'in indeksini birleştirme işleminde kullanmak için True olarak ayarlanır.

right_index: Sağ DataFrame'in indeksini birleştirme işleminde kullanmak için True olarak ayarlanır.

In [48]:
# DataFrame'leri oluşturalım
df1 = pd.DataFrame({'id': [1, 2, 3], 'isim': ['Ali', 'Veli', 'Ayşe']})
df2 = pd.DataFrame({'id': [2, 3, 4], 'soyisim': ['Yılmaz', 'Kaya', 'Demir']})

# 'id' sütununa göre birleştirelim
merged_df = pd.merge(df1, df2, on='id')

print(merged_df)

   id  isim soyisim
0   2  Veli  Yılmaz
1   3  Ayşe    Kaya

df_left.join(right, how='left', on=None, lsuffix='', rsuffix='')

Join Parametreleri:

right: Birleştirilecek sağ DataFrame.

how: Birleştirme türünü belirtir. 'left', 'right', 'outer', 'inner' değerlerini alabilir. Varsayılan değer 'left'tir.

on: Sol DataFrame'de birleştirme işleminde kullanılacak sütun adını veya adlarını belirtir. Varsayılan olarak, indeks kullanılır.

lsuffix: Sol DataFrame'deki çakışan sütun adlarına eklenecek soneki belirtir.

rsuffix: Sağ DataFrame'deki çakışan sütun adlarına eklenecek soneki belirtir.

In [49]:
# DataFrame'leri oluşturalım
df1 = pd.DataFrame({'isim': ['Ali', 'Veli', 'Ayşe']}, index=[1, 2, 3])
df2 = pd.DataFrame({'soyisim': ['Yılmaz', 'Kaya', 'Demir']}, index=[2, 3, 4])

# İndekslere göre birleştirelim
joined_df = df1.join(df2)

print(joined_df)

   isim soyisim
1   Ali     NaN
2  Veli  Yılmaz
3  Ayşe    Kaya

### 7. Bir dataframedeki bir sütunun tüm elemanlarına bir fonksiyonu nasıl uygularsınız?

In [50]:
# Örnek DataFrame
data = {'isim': ['Ali', 'Ayşe', 'Mehmet'],
        'yaş': [25, 30, 28]}
df = pd.DataFrame(data)

# Yaş sütunundaki her bir değere 2 ekleyen bir fonksiyon
def yasa_iki_ekle(yas):
  return yas + 2

# Fonksiyonu apply() metodu ile yaş sütununa uygulayalım
df['yeni_yaş'] = df['yaş'].apply(yasa_iki_ekle)

# Sonucu yazdıralım
print(df)

     isim  yaş  yeni_yaş
0     Ali   25        27
1    Ayşe   30        32
2  Mehmet   28        30

Lambda ile yapılışı

In [51]:
# Yaş sütunundaki her bir değeri 2 ile çarpma
df['iki_kat_yaş'] = df['yaş'].apply(lambda x: x * 2)

In [52]:
df

     isim  yaş  yeni_yaş  iki_kat_yaş
0     Ali   25        27           50
1    Ayşe   30        32           60
2  Mehmet   28        30           56

### 8. Bir dataframedeki tekrarlı verileri nasıl ele alırsınız?

In [53]:

# Örnek bir DataFrame oluşturma
data = {
    'A': [1, 2, 2, 3, 4, 4],
    'B': ['a', 'b', 'b', 'c', 'd', 'd']
}
df = pd.DataFrame(data)

# Tekrarlı verileri tespit etme
duplicates = df.duplicated()
print("Tekrarlı Satırlar:")
print(duplicates)

Tekrarlı Satırlar:
0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [54]:
df.duplicated().sum()

2

In [58]:
# Tekrarlı satırları inceleme
duplicate_rows = df[df.duplicated()]
print("\nTekrarlı Satırlar:")
print(duplicate_rows)

Tekrarlı Satırlar:
   A  B
2  2  b
5  4  d

In [55]:
# Tekrarlı satırları kaldırma
df_unique = df.drop_duplicates()
print("\nTekrarsız DataFrame:")
print(df_unique)

Tekrarsız DataFrame:
   A  B
0  1  a
1  2  b
3  3  c
4  4  d

df_last = df.drop_duplicates(keep='last')   # keep the last occurrence of each duplicate

In [56]:
# Sadece 'A' sütununa göre tekrarlı satırları kaldırma
df_unique_subset = df.drop_duplicates(subset=['A'])
print("\n'A' Sütununa Göre Tekrarsız DataFrame:")
print(df_unique_subset)

'A' Sütununa Göre Tekrarsız DataFrame:
   A  B
0  1  a
1  2  b
3  3  c
4  4  d

In [57]:
df.value_counts()

A  B
2  b    2
4  d    2
1  a    1
3  c    1
Name: count, dtype: int64

### 9. Pandasta kategorik veriyi numerik formata nasıl çevirirsiniz?

Genel olarak kullanılan iki yaklaşım Label Encoding ve One Hot Encoding/get_dummies.

**Label Encoding**

In [59]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

# Örnek bir DataFrame oluşturma
data = {
    'Renk': ['Kırmızı', 'Mavi', 'Yeşil', 'Kırmızı', 'Mavi', 'Sarı'],
    'Miktar': [10, 15, 10, 20, 25, 30]
}
df = pd.DataFrame(data)

print("Orijinal DataFrame:")
print(df)

Orijinal DataFrame:
      Renk  Miktar
0  Kırmızı      10
1     Mavi      15
2    Yeşil      10
3  Kırmızı      20
4     Mavi      25
5     Sarı      30

In [60]:

# LabelEncoder nesnesi oluşturma
label_encoder = LabelEncoder()

# 'Renk' sütununu sayısal verilere dönüştürme
df['Renk_encoded'] = label_encoder.fit_transform(df['Renk'])

print("\nLabel Encoding Uygulandıktan Sonra DataFrame:")
print(df)

# Kategorik değerlerin etiketlerini görüntüleme
print("\nKategorik Değerlerin Etiketleri:")
for i, item in enumerate(label_encoder.classes_):
    print(f"{item}: {i}")

Label Encoding Uygulandıktan Sonra DataFrame:
      Renk  Miktar  Renk_encoded
0  Kırmızı      10             0
1     Mavi      15             1
2    Yeşil      10             3
3  Kırmızı      20             0
4     Mavi      25             1
5     Sarı      30             2

Kategorik Değerlerin Etiketleri:
Kırmızı: 0
Mavi: 1
Sarı: 2
Yeşil: 3

**One Hot Encoding / get_dummies**

In [65]:
# Örnek bir DataFrame oluşturma
data = {
    'Renk': ['Kırmızı', 'Mavi', 'Yeşil', 'Kırmızı', 'Mavi', 'Sarı'],
    'Miktar': [10, 15, 10, 20, 25, 30]
}
df = pd.DataFrame(data)

print("Orijinal DataFrame:")
print(df)

# One Hot Encoding uygulama
df_one_hot = pd.get_dummies(df, columns=['Renk'], drop_first=True)

print("\nOne Hot Encoding Uygulandıktan Sonra DataFrame:\n")
print(df_one_hot)

Orijinal DataFrame:
      Renk  Miktar
0  Kırmızı      10
1     Mavi      15
2    Yeşil      10
3  Kırmızı      20
4     Mavi      25
5     Sarı      30

One Hot Encoding Uygulandıktan Sonra DataFrame:

   Miktar  Renk_Mavi  Renk_Sarı  Renk_Yeşil
0      10      False      False       False
1      15       True      False       False
2      10      False      False        True
3      20      False      False       False
4      25       True      False       False
5      30      False       True       False

### 10. where() metodunu kullanarak sütunlara koşullu mantığın nasıl uygulanacağını gösterin.

In [76]:
import pandas as pd

data = {'Ürün': ['A', 'B', 'C', 'D', 'E'],
        'Fiyat': [10, 25, 15, 30, 20],
        'Stok': [50, 30, 20, 10, 40]}

df = pd.DataFrame(data)
df

  Ürün  Fiyat  Stok
0    A     10    50
1    B     25    30
2    C     15    20
3    D     30    10
4    E     20    40

In [72]:
# Fiyatı 20'den büyük olan ürünleri filtreleme
df.where(df['Fiyat'] > 20)

  Ürün  Fiyat  Stok
0  NaN    NaN   NaN
1    B   25.0  30.0
2  NaN    NaN   NaN
3    D   30.0  10.0
4  NaN    NaN   NaN

In [73]:
# Stoku 25'ten az olan ürünlerin fiyatını 0 yapma
df['Fiyat'] = df['Fiyat'].where(df['Stok'] >= 25, other=0)
df

  Ürün  Fiyat  Stok
0    A     10    50
1    B     25    30
2    C      0    20
3    D      0    10
4    E     20    40

In [82]:
# Birden fazla koşul kullanma
df.where((df['Fiyat'] > 15) & (df['Stok'] > 20), other='Düşük Stok')

         Ürün       Fiyat        Stok
0  Düşük Stok  Düşük Stok  Düşük Stok
1           B          25          30
2  Düşük Stok  Düşük Stok  Düşük Stok
3  Düşük Stok  Düşük Stok  Düşük Stok
4           E          20          40

### 11. Bir DataFrame'deki verileri nasıl pivotlayabilirsiniz?

Pandas kütüphanesinde DataFrame'lerdeki verileri pivotlamak için pivot() ve pivot_table() fonksiyonları kullanılabilir.

pivot() fonksiyon, verilerinizi yeniden şekillendirmenize ve belirli bir sütunu indeks, başka bir sütunu sütun başlıkları ve üçüncü bir sütunu da değerler olarak kullanarak yeni bir DataFrame oluşturmanıza olanak tanır.

In [84]:
# Örnek DataFrame
data = {'Tarih': ['2023-03-01', '2023-03-01', '2023-03-02', '2023-03-02'],
        'Ürün': ['A', 'B', 'A', 'B'],
        'Satış': [10, 15, 12, 20]}
df = pd.DataFrame(data)

df

        Tarih Ürün  Satış
0  2023-03-01    A     10
1  2023-03-01    B     15
2  2023-03-02    A     12
3  2023-03-02    B     20

In [85]:
# DataFrame'i pivotlama
pivot_df = df.pivot(index='Tarih', columns='Ürün', values='Satış')

print(pivot_df)

Ürün         A   B
Tarih
2023-03-01  10  15
2023-03-02  12  20

pivot_table() fonksiyonu aynı indeks ve sütun kombinasyonuna sahip birden fazla değeri işlemenize olanak tanır. Bunu yaparken, belirli bir agregasyon fonksiyonunu (varsayılan olarak mean) kullanarak bu değerleri birleştirir.

In [89]:
# Sample DataFrame with duplicate entries
data = {
    'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02', '2023-01-01'],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'New York'],
    'Temperature': [30, 70, 32, 68, 28]
}
df = pd.DataFrame(data)

print("Original DataFrame with Duplicates:")
print(df)

# Pivoting the DataFrame with aggregation
pivot_table_df = df.pivot_table(index='Date', columns='City', values='Temperature', aggfunc='mean')

print("\nPivot Table DataFrame:")
print(pivot_table_df)

Original DataFrame with Duplicates:
         Date         City  Temperature
0  2023-01-01     New York           30
1  2023-01-01  Los Angeles           70
2  2023-01-02     New York           32
3  2023-01-02  Los Angeles           68
4  2023-01-01     New York           28

Pivot Table DataFrame:
City        Los Angeles  New York
Date
2023-01-01           70        29
2023-01-02           68        32

### 12. Pandas ile bir dataframe'i csv olarak nasıl kaydedersiniz?

In [ ]:
import pandas as pd

# Örnek bir DataFrame oluşturalım
data = {'İsim': ['Ali', 'Ayşe', 'Mehmet'],
        'Yaş': [25, 30, 28],
        'Şehir': ['İstanbul', 'Ankara', 'İzmir']}

df = pd.DataFrame(data)

# DataFrame'i "veri.csv" adlı bir CSV dosyasına kaydedelim
df.to_csv('veri.csv', index=False)

### 13. Pandas'da slicing ve filtering nedir?

In [ ]:
data = {
    'A': [1, 2, 3, 4, 5],
    'B': ['a', 'b', 'c', 'd', 'e'],
    'C': [10, 20, 30, 40, 50]
}
df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

# Slicing the DataFrame to get the first three rows and the first two columns
sliced_df = df.iloc[0:3, 0:2]

print("\nSliced DataFrame (first 3 rows and first 2 columns):")
print(sliced_df)

In [ ]:
# Filtering the DataFrame to get rows where column 'A' is greater than 2
filtered_df = df[df['A'] > 2]

print("\nFiltered DataFrame (rows where A > 2):")
print(filtered_df)

# <p style="background-color:green;font-family:newtimeroman;font-size:100%;color:white;text-align:center;border-radius:20px 20px;"><b>Faydalı Olması Temennisiyle Teşekkürler</b></p>
![](https://www.techproeducation.com/logo/headerlogo.svg)

<b>Yeniliklerden ilk siz haberdar olmak istiyorsanız lütfen bizi takip etmeyi unutmayın </b>[YouTube](https://www.youtube.com/c/techproeducation) | [Instagram](https://www.instagram.com/techproeducation) | [Facebook](https://www.facebook.com/techproeducation) | [Telegram](https://t.me/joinchat/HH2qRvA-ulh4OWbb) | [Whatsapp](https://api.whatsapp.com/send/?phone=%2B15853042959&text&type=phone_number&app_absent=0) | [LinkedIn](https://www.linkedin.com/company/techproeducation/mycompany/) |